# -*- coding: utf-8 -*-
from app.util.s_splitter import rule_based_candidate_split

if __name__ == "__main__":
    sample = (
        "알크마이온 가문은 원래부터 명망이 높았지만 알크마이온과 그 아들 메가클레스 때부터 명망이 더 높아짐. 크로이소스가 델포이에 신탁을 보낼 때 알크마이온이 여러모로 도와줌. 이에 크로이소스는 알크마이온을 사르디스로 초청해서 그가 한 몸에 가져갈 수 있을 만큼의 금을 선물로 주겠다고 함. 이에 알크마이온은 큼직한 장화에 큼직한 키톤을 입고 장화 안, 모든 키톤 주름, 심지어 머리카락 사이에 사금을 뿌리고 입에 사금을 머금어서 보물창고에서 나옴. 그 모습이 너무 우스꽝스러워서 포복절도하고는, 그만큼의 황금을 더 선물로 주었다고 함. 알크마이온은 크게 부자가 되었고, 사두마차 경주용 말을 갖게 되어 올림피아 경기에서 우승함."
    )

    spans = rule_based_candidate_split(sample)